# IMDB SQL Notebook
This notebook introduces the basics of SQL's Data Definition Language (DDL) and Data Manipulation Language (DML) and advanced SQL statements, such as joins and aggregation.

In [ ]:
-- Just run this and ignore. If you are interested in why this is needed for SQLite, 
-- read https://www.sqlite.org/foreignkeys.html at 2. Enabling Foreign Key Support
PRAGMA foreign_keys = ON;

# CREATE TABLE - DDL

Details on sqllite3 [datatypes](https://www.sqlite.org/datatype3.html).

First, you should create a table for actors, movies and roles:

* movies(id, name, year, rank)
* actors(id, first_name, last_name, gender)
* roles(actor_id, movie_id, role)

A identifier (`id`) is used as primary key. The `gender` always consist of exactly 1 character. `year` is a number and `rank` is a normal-size floating point number. No `name`, `first_name`, `last_name` or `role` should ever be `NULL` and all can have up to 100 characteres. A `roles`-entry always refererences a movie (`movie_id`) and an actor (`actor_id`). Therefore it should be deleted if the respective movie or actor were deleted. Each `role, actor_id, movie_id` combination should be unique.


### Show results
You can use `.schema` to show the result of your create statements and `.tables` to show only the table names.

In [ ]:
-- Delete tables if they exist so you can re-run this cell multiple times. 
-- If you get error with "table xx already exists" or "no such table xx", 
-- you might need to restart the Kernel. To do this, click on Kernel at the
-- top of the notebook and select Restart. Then you need to re-run all cells again.
DROP TABLE IF EXISTS movies;
DROP TABLE IF EXISTS actors;
DROP TABLE IF EXISTS roles;


-- Your CREATE TABLE statements here:



-- Show results
.schema

In [ ]:
-- Copy-paste our additional CREATE TABLES statements here for the full schema.

# Fill the database with life - DML

In this exercise, you should insert values into the following tables.


The movie table should look like this:

 id |   name   |   year   |   rank
----| -------- | -------- | --------
  4 | Ocean's 8 | 2018 | 6.2
  5 | Django Unchained | 2012 | 8.4
  6 | Reservoir Dogs | 1992 | 8.3



The actors table accordingly:

  id |   first_name   |   last_name   |   gender
-------- | -------- | -------- | --------
 1 | Christoph | Waltz | M   
 2 | Jamie | Foxx | M
 3 | Robert | De Niro | M
 4 | Meryl | Streep | F
    

The directors table:

id |   first_name   |   last_name 
-------- | -------- | -------- 
 1 | Quentin | Tarantino   
 2 | Steven | Soderbergh
 3 | Gary | Ross
 
 The genres table:
 
 
 id |   name
-------- | --------
 1 | Crime
 2 | Thriller  
 3 | Action

In [ ]:
-- Remove old entries so we don't have duplicates or errors for already existing records.
-- DELETE FROM movies;
-- DELETE FROM actors;
-- DELETE FROM roles;


-- Insert stuff here
-- Remember, the insert statement looks like this
-- INSERT INTO table_name(col_name1, col_name2, ..., col_nameN) 
--   VALUES (val1, val2, ..., valN)
--
-- or
-- 
-- INSERT INTO table_name VALUES (val1, val2, ..., valN)

-- Your INSERT INTO statements here:



-- Show results
-- SELECT * FROM movies;
-- SELECT * FROM actors;
-- SELECT * FROM directors;

In [ ]:
-- COPY THE ADDITIONAL INSERT STATEMENTS HERE

# Altering an existing table - DDL

In this exercise, you are required to alter an existing table to add columns.


The `movies` table should contain a `budget` (integer) column, which contains the amount of money that a movie cost.

The `roles` table should contain a `salary` (integer) column, which contains the salary an actor received for a role.

In [ ]:
-- Should you incorrectly alter the table, you might need to re-run the CREATE TABLE cell to get a clean start.

-- Your ALTER TABLE statement here:




-- Show results (the formatting might be a bit off after the ALTER TABLE, 
-- so it might show multiple columns in one row).
.schema movies
.schema roles

# Updating table values - DML

The added columns now need to be filled with data.

movies:

id       | name     |   year   |   budget
-------- | -------- | -------- | --------
4       | Oceans'8 | 2018     |  70000000
5       | Django Unchained       | 2012   |   100000000
6       | Reservoir Dogs       | 1992   |   1200000

In [ ]:
-- Should you incorrectly update the records, use SELECT * FROM to look 
-- at the current state to adjust your UPDATE statements.

-- Your UPDATE statement here:

In [ ]:
-- COPY THE ADDITIONAL INSERT STATEMENTS HERE
-- MOVIES

In [ ]:
-- COPY THE ADDITIONAL INSERT STATEMENTS HERE
-- MOVIE_GENRES

In [ ]:
-- COPY THE ADDITIONAL INSERT STATEMENTS HERE
-- MOVIE_DIRECTORS

In [ ]:
-- COPY THE ADDITIONAL INSERT STATEMENTS HERE
-- ROLES

# Querying the database - SQLite3

Let's use some SQL statements to query our new database :)

# Query 1: Return the average salary for ''Kill Bill 2''

In [ ]:
-- ENTER YOUR SQL QUERY HERE:

# Query 1a: Return the average salaries for all movies

In [ ]:
-- ENTER YOUR SQL QUERY HERE:

# Query 2: Return the average salaries for movies from all directors

In [ ]:
-- ENTER YOUR SQL QUERY HERE:

# Query 2a: Return the max. average salary based on the director

In [ ]:
-- ENTER YOUR SQL QUERY HERE:

# Query 3: Return the worst ranked movies from each genre

In [ ]:
-- ENTER YOUR SQL QUERY HERE:

# Query 4: Return the percentage paid for salaries from each movie's budget

In [ ]:
-- ENTER YOUR SQL QUERY HERE:

# Query 5: Return the best-paid genre

In [ ]:
-- ENTER YOUR SQL QUERY HERE:

# Query 5a: Restrict the number of movies (at least 2 movies/genre)

In [ ]:
-- ENTER YOUR SQL QUERY HERE:

# Query 6: Return the actors and the roles for which they had salary lower than the average

In [ ]:
-- ENTER YOUR SQL QUERY HERE:

# Query 7: Return the busiest actors (all instances)

In [ ]:
-- ENTER YOUR SQL QUERY HERE: